In [1]:
print(getwd())

[1] "C:/Users/AW/OneDrive/Phu/Python/7. R Programming Language for Data Science/BaiTap/Chapter9"

In [3]:
content = readLines('Du_lieu/license.txt')

In [4]:
print(content)

[1] "These data files are derived by splitting up the data set downloaded from:"
[2] "https://www.ontario.ca/data/ontario-public-schools-enrolment"
[3] "under the Open Government License - Ontario:"
[4] "https://www.ontario.ca/page/open-government-licence-ontario"

In [6]:
bai_tho = readLines('Du_lieu/bai_tho.txt', encoding = 'UTF-8')
print(bai_tho)

[1] "Mùa xuân là Tết trồng cây"
[2] "Làm cho đất nước càng ngày càng xuân"
[3] ""

In [7]:
print(length(content))
print(nchar(content))

[1] 4
[1] 74 60 44 59

In [9]:
print(file.size('Du_lieu/license.txt'))

[1] 242

In [10]:
content1 = scan('Du_lieu/license.txt','')
print(content1)

 [1] "These"
 [2] "data"
 [3] "files"
 [4] "are"
 [5] "derived"
 [6] "by"
 [7] "splitting"
 [8] "up"
 [9] "the"
[10] "data"
[11] "set"
[12] "downloaded"
[13] "from:"
[14] "https://www.ontario.ca/data/ontario-public-schools-enrolment"
[15] "under"
[16] "the"
[17] "Open"
[18] "Government"
[19] "License"
[20] "-"
[21] "Ontario:"
[22] "https://www.ontario.ca/page/open-government-licence-ontario"

In [18]:
df = read.table('Du_lieu/Table0.txt')
print(df)

        V1 V2  V3 V4 V5
1     Alex 25 177 57  F
2    Lilly 31 163 69  F
3     Mark 23 190 83  M
4   Oliver 52 179 75  M
5   Martha 76 163 70  F
6    Lucas 49 183 83  M
7 Caroline 26 164 53  F

In [20]:
df_F = df[df$V5 == 'F',]
print(df_F)

        V1 V2  V3 V4 V5
1     Alex 25 177 57  F
2    Lilly 31 163 69  F
5   Martha 76 163 70  F
7 Caroline 26 164 53  F

In [21]:
df_F = df[df['V5'] == 'F',]
print(df_F)

        V1 V2  V3 V4 V5
1     Alex 25 177 57  F
2    Lilly 31 163 69  F
5   Martha 76 163 70  F
7 Caroline 26 164 53  F

In [22]:
content2 = 'Hello and welcome'
file_name = file(description = 'Du_lieu/text.txt', open = 'a', encoding = 'UTF-8')
write(content2, file=file_name)
content2 =  readLines('Du_lieu/text.txt')
print(content2)

[1] "Hello and welcome"

In [24]:
write.table(df,file = 'Du_lieu/Table0_new.txt',sep = '\t')

### Đọc csv

In [25]:
data = read.csv('Du_lieu/emp.csv')
data

  id name     salary start_date dept
1  1 Rick     623.30 2012-01-01 IT
2  2 Dan      515.20 2013-09-23 Operations
3  3 Michelle 611.00 2014-11-15 IT
4  4 Ryan     729.00 2014-05-11 HR
5 NA Gary     843.25 2015-03-27 Finance
6  6 Nina     578.00 2013-05-21 IT
7  7 Simon    632.80 2013-07-30 Operations
8  8 Guru     722.50 2014-06-17 Finance

In [27]:
print(is.data.frame(data))
print(ncol(data))
print(nrow(data))

[1] TRUE
[1] 5
[1] 8

In [31]:
print(paste("Max salary: ", max(data$salary)))
print(paste("Max salary: ", mean(data$salary)))
print(paste('People have max salary: '))
print(subset(data, salary == max(data$salary)))

[1] "Max salary:  843.25"
[1] "Max salary:  656.88125"
[1] "People have max salary: "
  id name salary start_date    dept
5 NA Gary 843.25 2015-03-27 Finance

### Ghi csv file

In [36]:
it_emp = subset(data , dept == 'IT')
write.csv(it_emp, 'Du_lieu/id_emp.csv')
newdata =  read.csv('Du_lieu/id_emp.csv')
print(newdata)

  X id     name salary start_date dept
1 1  1     Rick  623.3 2012-01-01   IT
2 3  3 Michelle  611.0 2014-11-15   IT
3 6  6     Nina  578.0 2013-05-21   IT

In [37]:
it_emp = subset(data , dept == 'IT')
write.csv(it_emp, 'Du_lieu/id_emp.csv', row.names = FALSE)
newdata =  read.csv('Du_lieu/id_emp.csv')
print(newdata)

  id     name salary start_date dept
1  1     Rick  623.3 2012-01-01   IT
2  3 Michelle  611.0 2014-11-15   IT
3  6     Nina  578.0 2013-05-21   IT

### Excel file

In [40]:
install.packages("openxlsx")

Installing package into 'C:/Users/AW/AppData/Local/R/win-library/4.3'
(as 'lib' is unspecified)

package 'openxlsx' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\AW\AppData\Local\Temp\Rtmp8olFEI\downloaded_packages

In [41]:
library(openxlsx)

In [42]:
data =  read.xlsx('Du_lieu/emp_data.xlsx', sheet = 1)
data

  id name     salary start_date dept
1 1  Rick     623.30 40909      IT
2 2  Dan      515.20 41540      Operations
3 3  Michelle 611.00 41958      IT
4 4  Ryan     729.00 41770      HR
5    Gary     843.25 42090      Finance
6 6  Nina     578.00 41415      IT
7 7  Simon    632.80 41485      Operations
8 8  Guru     722.50 41807      Finance

In [43]:
data_city =  read.xlsx('Du_lieu/emp_data.xlsx', sheet = 'city')
data_city

  name     city
1 Rick     Seattle
2 Dan      Tampa
3 Michelle Chicago
4 Ryan     Seattle
5 Gary     Houston
6 Nina     Boston
7 Simon    Mumbai
8 Guru     Dallas

In [46]:
data_IT = subset(data, dept == 'IT')
data_IT

  id name     salary start_date dept
1 1  Rick     623.3  40909      IT
3 3  Michelle 611.0  41958      IT
6 6  Nina     578.0  41415      IT

In [47]:
write.xlsx(data_IT, file =  'Du_lieu/emp_IT.xlsx', sheetName = 'IT', append = FALSE)

In [50]:
emp_IT = read.xlsx('Du_lieu/emp_IT.xlsx', sheet = 'IT')
emp_IT

  id name     salary start_date dept
1 1  Rick     623.3  40909      IT
2 3  Michelle 611.0  41958      IT
3 6  Nina     578.0  41415      IT